
{
  "welcome": {
    "ru": "🚀 Добро пожаловать в BitBrain, {name}! 🦸‍♂️\n\nЯ - твой личный тренер для мозга! Пока ты живешь своей жизнью, я буду тайно прокачивать твой интеллект крутейшими фактами и знаниями.\n\n✨ *Твои преимущества:*\n• Учись без усилий - просто живи!\n• Получай знания в паузах и очередях\n• Становись умнее каждый день на автопилоте\n\n🎯 Погнали в будущее, где ты - ходячая энциклопедия!",
    "en": "🚀 Welcome to BitBrain, {name}! 🦸‍♂️\n\nI'm your personal brain trainer! While you live your life, I'll secretly upgrade your intelligence with amazing facts and knowledge.\n\n✨ *Your benefits:*\n• Learn effortlessly - just live your life!\n• Get knowledge during breaks and queues\n• Become smarter every day on autopilot\n\n🎯 Let's rock the future where you're a walking encyclopedia!"
  },
  "noTopic": {
    "ru": "🤔 Ой, кажется, мы еще не выбрали тему для обучения! Просто напиши мне название интересующей тебя темы для обучения!",
    "en": "🤔 Oh, I don't think we've chosen a topic for training yet! Just write me the name of the topic you are interested in!"
  },
  "hasTopic": {
    "ru": "📚 У тебя уже выбрана тема для обучения: *{topic}*!\n\nХочешь сменить тему? Просто напиши название новой, и я переключу твое обучение на нее!\n\n🔄 Смена темы - это не провал, а апгрейд знаний!",
    "en": "📚 You already have a learning topic selected: *{topic}*!\n\nWant to change the topic? Just write the name of a new one, and I'll switch your training to it!\n\n🔄 Changing topics isn't a failure, it's a knowledge upgrade!"
  },
  "topicLengthError": {
    "ru": "⚠️ Тема выходит за рамки допустимого диапазона. Пожалуйста, введите тему от 3 до 50 символов.",
    "en": "⚠️ Topic is out of acceptable range. Please enter a topic from 3 to 50 characters."
  },
  "topicSaved": {
    "ru": "✅ Отлично! Я записал вашу тему обучения: \"{topic}\". Теперь я буду присылать вам материалы по этой теме.",
    "en": "✅ Great! I've saved your learning topic: \"{topic}\". Now I'll send you materials on this topic."
  },
  "userNotFound": {
    "ru": "❌ Ошибка: пользователь не найден. Пожалуйста, используйте команду /start для регистрации.",
    "en": "❌ Error: user not found. Please use the /start command to register."
  },
  "topicSaveError": {
    "ru": "❌ Произошла ошибка при сохранении темы. Пожалуйста, попробуйте еще раз.",
    "en": "❌ An error occurred while saving the topic. Please try again."
  }
}